# DBeam_Get2DLn2FOff

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_Get2DLn2FOff : HANDLE;
```

```python

def vs.DBeam_Get2DLn2FOff():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight